src/Автолавки/src/Documents/ЗагрузкаТоваровВАвтолавку/ЗагрузкаТоваровВАвтолавку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗагрузкаТоваровВАвтолавку</name>
  <registerRecords>AccumulationRegister.ТоварыВАвтолавке</registerRecords>
  <attributes>
    <name>НомерПутевогоЛиста</name>
    <type>
      <types>DocumentRef.ПутевойЛист</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокТоваров</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Автолавки/src/AccumulationRegisters/ТоварыВАвтолавке/ТоварыВАвтолавке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВАвтолавке</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Автолавки/src/Documents/ЗагрузкаТоваровВАвтолавку/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ТЗ = СписокТоваров.Выгрузить();
	ТЗ.Свернуть("Товар", "Количество");
	
	Движения.ТоварыВАвтолавке.Записывать = Истина;
	Для Каждого ТекСтрокаСписокТоваров Из ТЗ Цикл
		Движение = Движения.ТоварыВАвтолавке.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаСписокТоваров.Товар;
		Движение.Количество = ТекСтрокаСписокТоваров.Количество;
	КонецЦикла;

КонецПроцедуры
